#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/achterkamp/gh-actions-gcp/runs/run-voR7TM9F4Ae72uQ3

Waiting for the plan to start...

Terraform v0.15.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
google_compute_global_address.website_1: Refreshing state... [id=projects/p-57068-gke/global/addresses/website-lb-ip-1]
google_compute_global_address.website: Refreshing state... [id=projects/p-57068-gke/global/addresses/website-lb-ip]
google_storage_bucket.website: Refreshing state... [id=p-57068-cdn-web-2]
google_compute_backend_bucket.website: Refreshing state... [id=projects/p-57068-gke/global/backendBuckets/website-backend]
google_storage_default_object_access_control.website_read: Refreshing state... [id=p-57068-cdn-web-2/allUsers]
google_dns_record_set.website: Refreshing state... [id=projects/p-57068-gke/managedZones/devops100-tk-zone/rrsets/github.devops100.tk./A]
google_dns_record_set.website_1: Refreshing state... [id=projects/p-57068-gke/managedZones/devops100-tk-zone/rrsets/www.devops100.tk./A]
google_compute_url_map.website: Refreshing state... [id=projects/p-57068-gke/global/urlMaps/website-url-map]
google_compute_managed_ssl_certificate.website: Refreshing state... [id=projects/p-57068-gke/global/sslCertificates/website-cert]
google_compute_target_https_proxy.website: Refreshing state... [id=projects/p-57068-gke/global/targetHttpsProxies/website-target-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/p-57068-gke/global/forwardingRules/website-forwarding-rule]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket_object.hello will be created
  + resource "google_storage_bucket_object" "hello" {
      + bucket         = "p-57068-cdn-web-2"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "hello.html"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "/web_static/hello.html"
      + storage_class  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ https_domain = [
      ~ {
          ~ domains = [
              - "github.devops100.tk.",
              + "github.devops100.tk",
            ]
        },
    ]
```

</details>

*Pusher: @albert-achterkamp, Action: `pull_request`*